Repository: bksubhuti/buddhist_sun
Catalog: lib/l10n/app_*.arb
Languages: hi, km, my, si, th, vi, zh

source: Buddhist Sun
hi: बौद्ध सूर्य
my: ဗုဒ္ဓနေ!
si: බෞද්ධ හිරු!
vi: Giờ Mặt Trời Dành Cho Đạo Phật
zh: 佛日

source: Noon
hi: दोपहर
km: ថ្ងៃត្រង់
my: မွန်းတည့်
si: දහවල්
th: เที่ยงวัน
vi: Trưa
zh: 正午

source: Dawn
hi: भोर
km: ពេលអរុណរះ
my: အရုဏ်
si: අලුයම
th: อรุณ
vi: Bình Minh
zh: 明相

source: Timer
hi: टाइमर
km: ពេលវេលា
my: အချိန်မှတ်ကိရိယာ
si: ටයිමර්
th: ตัวจับเวลา
vi: Bộ hẹn giờ
zh: 计时器

source: GPS
hi: जीपीएस
km: ប្រព័ន្ធកំណត់ទីតាំងសកល
my: ဂျီပီအက်စ်

source: Settings
hi: सेटिंग्स
km: ការកំណត់
my: ဆက်တင်
si: සැකසුම්
th: การตั้งค่า
vi: Cài đặt
zh: 设置

source: Help
hi: सहायता
km: ជំនួយ
my: အကူအညီ
si: උදව්
th: ช่วยเหลือ
vi: Trợ giúp
zh: 帮助

source: About
hi: के बारे में
km: អំពី
my: အကြောင်းအ⁠ရာ
si: ගැන
th: เกี่ยวกับ
vi: Giới thiệu
zh: 关于

source: Licenses
hi: लाइसेंस
km: អាជ្ញាប័ណ្ណ
my: လိုင်စင်
si: බලපත්ර
th: ใบอนุญาต
vi: Giấy phép
zh: 许可

source: Not Set
hi: सेट नहीं किया गया
km: មិនបានកំណត់
my: မသတ်မှတ်ထား
si: සකසා නැත
th: ไม่ได้ตั้งค่า
vi: Chưa cài đặt
zh: 未设置

source: Solar Noon
hi: सौर दोपहर
km: ព្រះអាទិត្យរះត្រង់
my: နေမွန်းတည့်
si: සූර්ය දවල්
th: เที่ยงวัน
vi: Đứng bóng
zh: 日中时分

source: GMT Offset
hi: जीएमटी ऑफ़सेट
km: GMT អុហ្វសិត
my: GMTအချိန်ကွာခြားချက်
si: GMT ඕෆ්සෙට්
th: ต่างจาก GMT
vi: Độ lệch so với GMT
zh: GMT 偏移

source: hours
hi: घंटे
km: ម៉ោង
my: နာရီ
si: පැය
th: ชั่วโมง
vi: giờ
zh: 小时

source: Astronomical Twilight
hi: खगोलिक गोधूलि
km: ថ្ងៃលិចនៃ Astronomical
my: နက္ခတ္တ​​ဗေဒအရုဏ်
si: තාරකා විද්‍යාත්මක ට්වි
th: สนธยาดาราศาสตร์
vi: Hoàng hôn thiên văn
zh: 天文曙光

source: Nautical Twilight
hi: नौसैनिक गोधूलि
km: ថ្ងៃលិចនៃ Nautical
my: ရေကြောင်းအရုဏ်
si: නාවික සැඳෑව
th: สนธยาทะเล
vi: Hoàng hôn hàng hải
zh: 航海曙光

source: Civil Twilight
hi: नागरिक गोधूलि
km: ថ្ងៃលិចនៃ Civil
my: မြို့ပြအရုဏ်
si: සිවිල් අන්ධකාරය
th: สนธยาพลเรือน
vi: Hoàng hôn dân sự
zh: 民用曙光

source: Sunrise
hi: सूर्योदय
km: ព្រះអាទិត្យរះ
my: နေထွက်ချိန်
si: හිරු උදාව
th: พระอาทิตย์ขึ้น
vi: Bình minh
zh: 日出

source: Date
hi: तारीख़
km: កាលបរិច្ឆេទ
my: ရက်စွဲ
si: දිනය
th: วันที่
vi: Ngày
zh: 日期

source: Current Time
hi: वर्तमान समय
km: ពេលវេលាបច្ចុប្បន្ន
my: လက်ရှိအချိန်
si: දැන් වේලාව
th: เวลาปัจจุบัน
vi: Giờ hiện tại
zh: 现在时间

source: Late
hi: देर
km: យឺត
my: နောက်ဆုံး
si: නැසීගිය
th: เลยเที่ยง
vi: Trễ
zh: 已过

source: Time Left
hi: शेष समय
km: ពេលវេលាដែលនៅសល់
my: ကျန်ရှိသောအချိန်
si: ඉතිරි කාලය
th: เหลือเวลา
vi: Thời gian còn lại
zh: 剩余时间

source: Speech Notify
hi: वाणी सूचना
km: ជូនដំណឹងជាសុន្ទរកថា
my: အသံဖြင့်အချက်ပေး
si: කථන දැනුම්දීම
th: แจ้งด้วยคำพูด
vi: Thông báo bằng lời
zh: 语音提示

source: Screen Always On
hi: स्क्रीन हमेशा चालू रहे
km: តែងតែបើកអេក្រង់
my: မျက်နှာပြင်အမြဲဖွင့်
si: තිරය සැමවිටම ක්‍රියාත්මකයි
th: หน้าจอเปิดตลอดเวลา
vi: Luôn bật màn hình
zh: 屏幕常亮

# speech_in_background
source: Speech in backgroun
hi: पृष्ठभूमि में वाणी
km: ជូនដំណឹងនៅផ្ទៃខាងក្រោយ
my: နောက်ကွယ်အသံအချက်ပေး
si: පසුපසට කථා කරන්න
th: คำพูดในพื้นหลัง
vi: Âm thanh chạy dưới nền
zh: 后台语音

source: Volume
hi: आवाज़
km: កំរិតសំលេង
my: အသံတိုးကျယ်
si: වෙළුම
th: ระดับเสียง
vi: Âm lượng
zh: 音量

# press_wait
source: Press and wait for new GPS.
hi: नए जीपीएस के लिए दबाएँ और प्रतीक्षा करें।
km: ចុច​នឹងរង់ចាំសម្រាប់កំណត់ទីតាំងថ្មី
my: နှိပ်ပြီးစောင့်သည်
si: එෆ් ඔබා බලා සිටින්නw GPS.
th: กด_รอ
vi: Bấm và chờ GPS mới.
zh: 按下等待新的 GPS.

source: Get GPS
hi: जीपीएस प्राप्त करें
km: ទទួលការកំណត់ទីតាំងថ្មី
my: ဂျီပီအက်စ် ရယူရန်
si: ජීපීඑස් ලබා ගන්න
th: รับ GPS
vi: Lấy GPS
zh: 获取GPS

source: Save GPS
hi: जीपीएस सहेजें
km: រក្សាទុកការកំណត់ទីតាំងថ្មី
my: ဂျီပီအက်စ် သိမ်းဆည်းရန်
si: ජීපීඑස් සුරකින්න
th: บันทึก GPS
vi: Lưu GPS
zh: 保存GPS

# set_gps_city
source: Set GPS city name by Internet
hi: इंटरनेट द्वारा जीपीएस शहर का नाम सेट करें
km: កំណត់ទីតាំង ឈ្មោះទីក្រុង ដោយអ៊ីនធើណិត
my: အင်တာနက်မှတဆင့် ဂျီပီအက်စ်တည်နေရာရှိ မြို့ကို ရွေးချယ်ရန်
si: ජීපීඑස් නගර අංකය සකසන්නInternet
th: ตั้งค่า GPS ตามตัวเมือง
vi: Cài GPS tên Thành Phố bằng Internet
zh: 网络设置GPS城市名称

source: Previous GPS is
hi: पिछला जीपीएस है
km: ទីតាំងពីមុនគឺ
my: ယခင်ဂျီပီအက်စ်မှာ
si: පෙර ජීපීඑස් වේ
th: GPS ก่อนหน้าคือ
vi: GPS trước là
zh: 以前的GPS是

source: Decimal Number
hi: दशमलव संख्या
km: ចំនួនលេខទសភាគ
my: ဒသမကိန်း
si: දශම අංකය
th: เลขทศนิยม
vi: Số thập phân
zh: 填入数字

source: Current offset is
hi: वर्तमान ऑफ़सेट है
km: អុហ្វសិតបច្ចុប្បន្នគឺ
my: လက်ရှိကွာခြားချက်
si: වර්තමාන ඕෆ්සෙට්
th: ความต่างจาก GMT ที่ใช้อยู่
vi: Độ lệch so với GMT hiện tại
zh: 当前标准时差是

source: Safety
hi: सुरक्षा
km: សុវត្ថិភាព
my: လုံခြုံမှု
si: ආරක්ෂාව
th: การตั้งเวลาเผื่อ
vi: Mức an toàn
zh: 安全时差

source: none
hi: कोई नहीं
km: គ្មាន
my: ဘာမှမထား
si: නැත
th: ไม่มี
vi: không
zh: 无

# minute1
source: 1 minute
hi: 1 मिनट
km: ១​ នាទី
si: 1 විනාඩියක්
th: 1 นาที
vi: 1 phút
zh: 1分钟

# minutes2
source: 2 minutes
hi: 2 मिनट
km: ២ នាទី
si: විනාඩි 2
th: 2 นาที
vi: 2 phút
zh: 2分钟

# minutes3
source: 3 minutes
hi: 3 मिनट
km: ៣ នាទី
si: විනාඩි 3
th: 3 นาที
vi: 3 phút
zh: 3分钟

# minutes4
source: 4 minutes
hi: 4 मिनट
km: ៤ នាទី
si: විනාඩි 4
th: 4 นาที
vi: 4 phút
zh: 4分钟

# minutes5
source: 5 minutes
hi: 5 मिनट
km: ៥ នាទី
si: විනාඩි 5
th: 5 นาที
vi: 5 phút
zh: 5分钟

# minutes10
source: 10 minutes
hi: 10 मिनट
km: ១០ នាទី
si: විනාඩි 10
th: 10 นาที
vi: 10 phút
zh: 10分钟

source: Pa-Auk
hi: पा-औक
my: ဖားအောက်
si: පා-ඕක්
th: พะอ๊อก
zh: 帕奥

source: Na-Uyana
hi: ना-उयाना
my: နာဂဥယျာန
si: නා-උයන
th: นะ อุยะนะ
zh: 龙树林

source: Search for city
hi: शहर खोजें
km: ស្វែងរកឈ្មោះទីក្រុង
my: မြို့ရှာရန်
si: නගරය සොයන්න
th: ค้นหาเมือง
vi: Tìm T.Phố
zh: 城市搜索

source: GPS Permission
hi: जीपीएस अनुमति
km: ការអនុញ្ញាតពីការកំណត់ទីតាំងសកល
my: ဂျီပီအက်စ် ခွင့်ပြုချက်
th: การอนุญาต GPS
vi: Quyền GPS
zh: GPS启用

source: Background Permission
hi: पृष्ठभूमि अनुमति
km: ការអនុញ្ញាតពីផ្ទៃខាងក្រោយ
my: နောက်ကွယ် ခွင့်ပြုချက်
th: การอนุญาตพื้นหลัง
vi: Quyền chạy nền
zh: 后台运行

source: Error
hi: त्रुटि
km: មានកំហុស
my: အမှား
th: ข้อผิดพลาด
vi: Lỗi
zh: 错误

source: Notification
hi: सूचना
km: សារជូនដំណឹង
my: အသိပေးချက်
th: การแจ้งเตือน
vi: Thông báo
zh: 提示

# running_in_background
source: Buddhist Sun Running In Background
hi: बौद्ध सूर्य पृष्ठभूमि में चल रहा है
my: နောက်ကွယ်တွင် အလုပ်လုပ်နေမည်
th: เเสดงในพื้นหลัง
vi: Buddhist Sun đang chạy nền
zh: 后台运行中

source: Background Initialized
hi: पृष्ठभूमि आरंभ की गई
km: រៀបចំផ្ទៃខាងក្រោយ
my: နောက်ကွယ်လုပ်ဆောင်ချက် စတင်ပြီးပြီ
th: เริ่มต้นพื้นหลังแล้ว
vi: Khởi tạo dưới nền
zh: 后台运行启动

source: Background Enabled
hi: पृष्ठभूमि सक्षम है
km: បានអនុញ្ញាតិផ្ទៃខាងក្រោយ
my: နောက်ကွယ်လုပ်ဆောင်ချက် ဖွင့်ရန်
th: เปิดใช้งานพื้นหลังแล้ว
vi: Nền đã được bật
zh: 后台运行开通

source: Background not set
hi: पृष्ठभूमि सेट नहीं की गई
km: មិនបានកំណត់ផ្ទៃខាងក្រោយ
my: နောက်ကွယ်လုပ်ဆောင်ချက် မသတ်မှတ်ထား
th: ไม่ได้ตั้งค่าพื้นหลัง
vi: Chưa bật nền
zh: 后台未设定

# background_init_error
source: Background initialize error
hi: पृष्ठभूमि आरंभ त्रुटि
km: ការរៀបចំផ្ទៃខាងក្រោយមានបញ្ហា
my: နောက်ကွယ်လုပ်ဆောင်ချက် စတင်မှု အမှားတွေ့
th: ข้อผิดพลาดในการเริ่มต้นพื้นหลัง
vi: Khởi tạo nền bị lỗi
zh: 后台启动错误

source: Background disabled
hi: पृष्ठभूमि अक्षम है
km: មិនបានអនុញ្ញាតិផ្ទៃខាងក្រោយ
my: နောက်ကွယ်လုပ်ဆောင်ချက် ပိတ်ထားသည်
th: พื้นหลังไม่ทำงาน
vi: Nền đã tắt
zh: 后台取消

source: OK
hi: ठीक है
km: យល់ព្រម
my: အိုကေ
th: ตกลง
vi: Đồng ý

source: Yes
hi: हाँ
km: បាទ,ចាស
my: ဟုတ်သည်
th: ใช่
vi: Có
zh: 是

source: No
hi: नहीं
km: ទេ
my: မဟုတ်ပါ
th: ไม่
vi: Không
zh: 否

source: Cancel
hi: रद्द करें
km: បោះបង់
my: ပယ်ဖျက်သည်
th: ยกเลิก
vi: Hủy
zh: 取消

# gps_not_available
source: GPS is not available
hi: जीपीएस उपलब्ध नहीं है
km: ការកំណត់ទីតាំងសកល មិនមាន
my: ဂျီပီအက်စ် မရနိုင်ပါ
th: GPS ไม่พร้อมใช้งาน
vi: GPS không có sẵn
zh: GPS无信号

# gps_recommend
source: GPS is recommended for best results. Would you like to set GPS?
hi: सर्वोत्तम परिणामों के लिए जीपीएस की अनुशंसा की जाती है। क्या आप जीपीएस सेट करना चाहेंगे?
km: ការកំណត់ទីតាំង ត្រូវបានណែនាំសម្រាប់លទ្ធផលល្អ. តើអ្នកចង់កំណត់ទីតាំងសកលដែរឬទេ?
my: အမှန်ဆုံးရလာဒ်အတွက် ဂျီပီအက်စ်တည်နေရာ ကို သုံးစွဲရန် အကြံပြုပါသည်။ ဂျီပီအက်စ်ကို သုံးစွဲလိုပါသလား?
th: แนะนำให้ใช้ GPS เพื่อผลลัพธ์ที่ดีที่สุด คุณต้องการตั้งค่า GPS หรือไม่?
vi: Khuyến cáo nên dùng GPS để cho kết quả tốt nhất. Bạn có muốn bật GPS hay không?
zh: 推荐使用GPS以获取最佳结果。您要启用GPS吗?

# gps_internet_message
source: If the Internet is turned on, the City Name can be referenced by GPS
hi: यदि इंटरनेट चालू है, तो शहर का नाम जीपीएस द्वारा प्राप्त किया जा सकता है
km: ប្រសិនបើអ៊ីនធើណិតត្រូវបានបើក, ឈ្មោះទីក្រុងអាចយោងដោយការកំណត់ទីតាំងសកល
my: အင်တာနက်ဖွင့်ထားလျှင် ဂျီပီအက်စ်ကနေ မြို့နာမည်ကို ဖော်ပြနိုင်သည်
th: หากอินเทอร์เน็ตเปิดอยู่ ชื่อเมืองสามารถอ้างอิงได้โดย GPS
vi: Nếu Internet được bật, tên Thành Phố có thể được tham khảo bằng GPS
zh: 互联网开通时，城市名称可以被GPS检寻定位。

source: Language
hi: भाषा
km: ភាសា
my: စကား
th: ภาษา
vi: Ngôn ngữ
zh: 语言

source: Theme
hi: थीम
km: គំរូរចនា
my: အရောင်
th: ธีม
vi: Chủ đề
zh: 主题

# help_content
source: Calculations: The calculations are based on equations from Astronomical Algorithms, by Jean Meeus. The sunrise and sunset results are theoretically accurate to within a minute for locations between +/- 72° of latitud. Please consider stopping well before the stated time. NOON: The Noon screen displays the Solar Noon for the current day as selected by GPS or City in an easy to view manner. All times reflect the safety from settings. (see below) DAWN: The Dawn screen displays the selected Dawn formula from the settings and also various solar calculations. All times reflect the safety from settings. Pa-Auk = ( Sunrise - 40 Minutes). Na-uyana = ( Sunrise - 30 minutes) (see below) GPS: GPS will automatically set the city if the Internet is on and the checkbox is checked. It is recommended that you use the GPS settings for your location because the Solar Noon will be most accurate this way. This was not tested with "Day Light Savings" locations. SETTINGS: Offset: This is automatically set when using GPS. If you use City Search in settings, you must select an offset (GMT +- your local time). Saftey: This subtracts minutes from the Noon time to make it earlier and adds to Dawnrise to make it later. The formula is accurate within one minute so the default safety is 1 minute. Dawn: Choose your prefered Dawnrise. Na-Uyana uses Sunrise -30 minutes, and Pa-Auk uses Sunrise -40 minutes. Safety will add x-Minutes to this time. Timer: The Timer screen allows for hands free audio notifications. Speech means "Text to Speech". The volume is controlled by the slider. Under normal conditions the speech notifications only work while the screen is on. To fix this, you can make the screen stay awake with the "Screen Always On" switch, or you can enable the "TTS with screen off" feature. This will enable "background" operation while your screen is off and prevent the device from entering sleep mode. You should test this background feature a few times before relying on it. Some phones may not allow it. We are not responsible for anything. When you close the applicaton, a method is called to stop the background task. You will know the app is running in the background by the sun icon displayed in the top of your phone's notification area (where the time and signal bars are). If Buddhist Sun is not in "background mode", you will not see a sun icon. This feature is not available for iOS users. The speech announcements are in the following minute intervals: 50,40,30,20,15,10,8,6,5,4,3,2,1,0 Privacy: A full privacy statement is located at: https://americanmonk.org/privacy-policy-for-buddhist-sun-app/ We do not collect information.
hi: गणनाएँ: गणनाएँ जीन मीयस की पुस्तक 'Astronomical Algorithms' पर आधारित हैं। सूर्योदय और सूर्यास्त के परिणाम सैद्धांतिक रूप से ±72° अक्षांशों के भीतर एक मिनट की सटीकता रखते हैं। कृपया बताए गए समय से पहले ही रुकने पर विचार करें। दोपहर: दोपहर स्क्रीन वर्तमान दिन की सौर दोपहर को जीपीएस या चुने हुए शहर के अनुसार दिखाती है। सभी समय सेटिंग्स में दी गई सुरक्षा को दर्शाते हैं। भोर: भोर स्क्रीन सेटिंग्स में चुने गए सूत्र के अनुसार भोर का समय दिखाती है। सभी समय सुरक्षा से समायोजित किए गए हैं। पा-औक = (सूर्योदय - 40 मिनट) ना-उयाना = (सूर्योदय - 30 मिनट) जीपीएस: यदि इंटरनेट चालू है और बॉक्स चयनित है तो जीपीएस स्वचालित रूप से शहर सेट कर देता है। अधिक सटीक सौर दोपहर के लिए जीपीएस का उपयोग करने की अनुशंसा की जाती है। यह ऐप 'डेलाइट सेविंग्स' स्थानों के लिए परीक्षण नहीं किया गया था। सेटिंग्स: ऑफसेट: यह जीपीएस उपयोग के समय स्वचालित रूप से सेट होता है। यदि आप सेटिंग्स में शहर खोज का उपयोग करते हैं, तो आपको ऑफसेट (जीएमटी ± आपका स्थानीय समय) चुनना होगा। सुरक्षा: यह समय को सुरक्षित बनाने के लिए दोपहर से मिनट घटाता है और भोर में जोड़ता है। डिफ़ॉल्ट सुरक्षा 1 मिनट है। भोर: अपनी पसंद की भोर का चयन करें। ना-उयाना सूर्योदय -30 मिनट और पा-औक सूर्योदय -40 मिनट का उपयोग करता है। सुरक्षा इस समय में मिनट जोड़ देगी। टाइमर: टाइमर स्क्रीन ऑडियो सूचनाएँ देती है। 'स्पीच' का अर्थ है 'टेक्स्ट टू स्पीच'। आवाज़ स्लाइडर द्वारा नियंत्रित होती है। सामान्यतः सूचनाएँ तभी काम करती हैं जब स्क्रीन चालू हो। इसे ठीक करने के लिए आप 'स्क्रीन हमेशा चालू' या 'स्क्रीन बंद रहते हुए टीटीएस' विकल्प चुन सकते हैं। यह सुविधा पृष्ठभूमि में काम करेगी और फ़ोन को स्लीप मोड में जाने से रोकेगी। कृपया भरोसा करने से पहले इस सुविधा को कुछ बार परीक्षण करें। वाणी सूचनाएँ इन मिनट अंतरालों पर होती हैं: 50,40,30,20,15,10,8,6,5,4,3,2,1,0 गोपनीयता: पूर्ण गोपनीयता नीति यहाँ देखें: https://americanmonk.org/privacy-policy-for-buddhist-sun-app/ हम कोई डेटा एकत्र नहीं करते हैं।
my: တွက်ချက်မှုများ တွက်ချက်မှုများသည် Jean Mssus ၏ နက္ခတ္တဗေဒဆိုင်ရာ အယ်လဂိုရီသမ်များပေါ်တွင် အခြေခံထားသည်။ နေဝင်ချိန်နှင့် နေထွက်ချိန်ရလဒ်များသည် သီအိုရီအရ လတ္တီကျုကွာခြားချက် 72 ဒီဂရီ အတွင်းတွင် တစ်မိနစ်လောက်နီးနီး တိကျသည်။ သို့လင့်စကား နိုင်ငံ့စံတော်ချိန်လာ မွန်းတည့် ၁၂ နာရီမထိုးမီ (ဆွမ်းစားခြင်းကိစ္စ)ရပ်ဆိုင်းသင့်ကြောင်း ကျေးဇူးပြု၍ နှလုံးသွင်းထားပါ။ မွန်းတည့်ချိန် မွန်းတည့်ချိန်ပြ မျက်နှာပြင်သည် ရွေးချယ်ထားသော ဂျီပီအက်စ်(သို့)မြို့အလိုက် နေမွန်းတည့်ချိန်ကို ဖော်ပြသည်။ ဆက်တင်အပြင်အဆင်၌ မွန်းတည့်ပြီးလားဟု သံသယမဖြစ်အောင် ထပ်ပေါင်းထည့်ထားသော အချိန်အားလျော်စွာ မွန်းတည့်ချိန်စသောအချိန်တို့ကို ဖော်ပြပါသည်။ (အောက်တွင် ထပ်မံ ကြည့်ရှုပါ) အရုဏ်တက်ချိန် အရုဏ်တက်ချိန်ပြ မျက်နှာပြင်သည် ဆက်တင်၌ ရွေးချယ်ထားသော အရုဏ်တက်တွက်ချက်မှုဆိုင်ရာ ဖော်မြူလာအားလျော်စွာ အရုဏ်တက်ချိန်ကို ဖော်ပြပါသည်။ အမျိုးမျိုးသော အရုဏ်ချိန်များကိုလည်း ဖော်ပြပါသည်။ မွန်းတည့်ပြီးလားဟု သံသယမဖြစ်အောင် ထပ်ပေါင်းထည့်ထားသော ဆက်တင်သတ်မှတ်ချက် အချိန်အားလျော်စွာ အရုဏ်တက်ချိန် စသည်တို့ကို ဖော်ပြပါသည်။ ဖားအောက် = (နေထွက်ချိန်မှ မိနစ် ၄၀ နှုတ်) နာဂဥယျာန = (နေထွက်ချိန်မှ မိနစ် ၃၀ နှုတ်) (အောက်တွင် ထပ်မံ ကြည့်ရှုပါ) ဂျီပီအက်စ် ဂျီပီအက်စ် အင်တာနက်ဖွင့်ထားပြီး အမှန်ခြစ်စစ်ဆေးထားလျှင် ဂျီပီအက်စ် တည်ရာမြို့ကို အလိုအလျောက် ရွေးချယ်ပါလိမ့်မည်။ ဂျီပီအက်စ် ဆက်တင်သတ်မှတ်ချက်ကို သင့်ရဲ့နေရာအတည်ပြုဖို့အတွက် သုံးစွဲရန် အကြံပြုပါတယ်။ ဒီနည်းနှင့်ဆိို နေမွန်းတည့်ချိန် အတိကျဆုံး ဖြစ်ပါလိမ့်မည်။ မြို့နာမည်များဖြင့် တိတိကျကျ ဖြစ်/မဖြစ် မစမ်းသပ်ရသေးပါ။ Day Light Savings Settings Offset GPS ကိုအလိုအလျောက်ချိန်ပြီးဖြစ်သည်။ Setting မှာ သင် City Search ကိုသုံးလျှင် သင်အချိန်ကွာခြားချက်ကိုရွေးရမည်။ သံသယကင်းရှင်းရေး မွန်းတည့်ချိန်မှ မိနစ်များနှတ်လျှင်စောသွားပြီး နံနက်ချိန်တွင်ပေါင်းလျင် နောက်ကျလိမ့်မည်။ ဖော်ြမူလာသည်တစ်မိနစ်အတွင်းတိကျသည်။ ထို့ကြောင့်ပုံမှန်လုံခြုံရေးသည် တစ်မိနစ်ဖြစ်သည်။ အရုဏ် သင်ကြိုက်နှစ်သက်သော အရုဏ်တက်ချိန်ကိုရွေးချယ်ပါ။ နာဂဥယျာနတောရကျောင်း(သီရိလ​င်္ကာ)က နေထွက်ချိန်မှ မိနစ် ၃၀ နှုတ်၍ အရုဏ်တက်ချိန်အဖြစ် သတ်မှတ်သည်။ ဖားအောက်တောရကား နေထွက်ချိန်မှ မိနစ် ၄၀ နှုတ်၍ အရုဏ်တက်ချိန်အဖြစ် သတ်မှတ်သည်။ သံသကင်းအောင် ပိုထည့်ထားသော မိနစ်(များ)ကို အရုဏ်တက်ချိန်ထဲ ပေါင်းထည့်၍ ပြသပေးပါမည်။ အချိန်မှတ်ကိရိယာ အချိန်မှတ်တမ်းပြ မျက်နှာပြင်က အသံဖြင့် မွန်းတည့်ရန် ကျန်ရှိနေသေးသော အချိန်ကို အသံဖြင့် အသိပေးပါလိမ့်မည်။ အချက်ပေးသံ အတိုးအကျယ်ကို ဘားကို ပွတ်ဆွဲ၍ အတိုးအလျှော့ ပြုနိုင်ပါသည်။ ဖုန်းမျက်နှာပြင် ပေါ်နေသည့်အချိန်မှသာ အသံဖြင့် အချက်ပေးမှု ပုံမှန် အလုပ်လုပ်သည်။ (မျက်နှာပြင် ပိတ်ထားက အလုပ်မလုပ်ပါ) အသံဖြင့် အချက်ပေးမှု အဆင်ပြေပြေ လုပ်ဆောင်နိုင်ရန်အတွက် "ဖုန်းမျက်နှာပြင်အမြဲဖွင့်" ခလုပ်ကို ဖွင့်ထားပါ။ သို့မဟုတ် "နောက်ကွယ်အသံအချက်ပေး" ခလုပ်ကို ဖွင့်ထားပါ။ "နောက်ကွယ်အသံအချက်ပေး"စနစ်သည် ဖုန်းမျက်နှာပြင်ပိတ်ထားသော်လည်း အသံဖြင့် အသံချက်ပေးနိုင်ပါသည်။ ၎င်းစနစ်ကို လေးငါးကြိမ်ခန့် စမ်းသပ်အသုံးပြုကြည့်ပြီးမှသာ နေ့စဉ်သုံးအဖြစ် သုံးသင့်ပါသည်။ အချို့ဖုန်းများတွင် ၎င်းစနစ်ကို ခွင့်ပြုမထားပါ။ ကျွန်ုပ်တို့ အကုန်လုံးအတွက် တာဝန်မယူနိုင်ပါ။ သင် အက်ပလီကေးရှင်းကို ပိတ်လိုက်သည့်အခါ နောက်ကွယ်အသံအချက်ပေးစနစ် ပိတ်သွားအောင် စီမံထားပါသည်။ နောက်ကွယ်စနစ် အလုပ် လုပ်နေ/မလုပ်နေသည်ကို သင့်ဖုန်း၏ အသိပေးမှုပြ နေရာ၌ ယခု⁠အပ်ပလီကေးရှင်း၏ ပုံ ပေါ်နေ/မပေါ်နေ ကြည့်၍ သိနိုင်ပါသည်။ နောက်ကွယ်စနစ် အလုပ်မလုပ်နေပါက အဆိုပါပုံ ပေါ်နေလိမ့်မည် မဟုတ်ပါ။ IOS အသုံးပြုသူများအတွက် ဤစနစ် မရနိုင်သေးပါ။ မိနစ် 50,40,30,20,15,10,8,6,5,4,3,2, 1,0 တို့အကြားတွင် အသံဖြင့် အသံဖြင့် အချက်ပေးပါသည်။ ကိုယ်ရေးလုံခြုံမှု ကိုယ်ရေးလုံခြုံမှုဆိုင်ရာ အချက်အလက်များအားလုံကို အောက်တွင် ပေးထားသော လင့်တွင် ကြည့်ရှုနိုင်ပါသည်။ https://americanmonk.org/privacy-policy-for-buddhist-sun-app/ ကျွန်ပ်တို့ သင်၏ သတင်းအချက်အလက်များကို စုဆောင်းခြင်း မလုပ်ပါ။
th: การคำนวณ: การคำนวณอิงตามสมการจากอัลกอริทึมทางดาราศาสตร์ที่ถูกคิดค้นโดย Jean Meeus โดยเวลาพระอาทิตย์ขึ้นเเละเวลาพระอาทิตย์ตกดินในพื้นที่ที่ตั้งอยู่ในระหว่างละติจูด +/- 72° นั้นมีความคลาดเคลื่อนไม่เกิน 1 นาที โปรดพิจาราณาหยุดฉันก่อนเวลาดังกล่าว เที่ยงวัน: จอแสดงเที่ยงวันจะเเสดงตามเเบบสุริยคติของวันนั้นๆ ตามที่ถูกกำหนดโดย GPS หรือเมือง ทั้งนี้เพื่อให้ท่านดูเวลาได้อย่างสะดวก ทุกเวลาที่แสดงในแอปนี้ขึ้นอยู่กับค่าที่ตั้งไว้ในโหมดการตั้งเวลาเผื่อในการตั้งค่า (ดูตามด้านล่าง) DAWN: จอเเสดงอรุณจะเเสดงในรูปเเบบอรุณที่เลือกไว้จากการตั้งค่าเเละจากการคำนวณทางสุริยคติ ทุกเวลาที่แสดงในแอปนี้ขึ้นอยู่กับค่าที่ตั้งไว้ในโหมดการตั้งเวลาเผื่อในการตั้งค่า พะอ๊อก = (ก่อนพระอาทิตย์ขึ้น 40 นาที) นา อุยานะ = (ก่อนพระอาทิตย์ขึ้น 30 นาที) (see below ดูตามด้านล่าง) GPS: GPS จะตั้งค่าเมืองโดยอัตโนมัติหากอินเทอร์เน็ตเปิดใช้งานอยู่และทำเครื่องหมายในช่อง ขอแนะนำให้คุณใช้การตั้งค่า GPS ระบุตำแหน่งของคุณ เนื่องจากเวลาเที่ยงเเบบสุริยคติจะแสดงผลแม่นยำที่สุดด้วยวิธีนี้ โหมดนี้ไม่ได้ถูกทดสอบด้วยตำแหน่งที่ตั้งที่เป็น "เวลาออมแสง" การตั้งค่า: Offset: โหมดนี้จะถูกตั้งค่าโดยอัตโนมัติเมื่อใช้ GPS หากคุณใช้การค้นหาเมืองในการตั้งค่า (GMT +- your local time) คุณต้องเลือกความต่างจาก GMT (GMT +- เวลาท้องถิ่นของคุณ) ความปลอดภัย: วิธีนี้จะลบนาทีจากเวลาเที่ยงเพื่อให้เร็วขึ้น และบวกเวลาอรุณขึ้นเพื่อเผื่อเวลาในภายหลัง เนื่องด้วยสูตรมีความแม่นยำภายใน 1 นาที ดังนั้นการตั้งเวลาเผื่อเริ่มต้นคือ 1 นาที อรุณ: เลือกเวลาการขึ้นของอรุณ ที่ต้องการ นา อุยานะใช้เวลาพระอาทิตย์ขึ้น -30 นาที และพะอ๊อกใช้เวลาพระอาทิตย์ขึ้น -40 นาที ความปลอดภัยจะเพิ่ม x-นาที ในเวลานี้ Timer ตัวจับเวลา: หน้าจอตัวจับเวลาช่วยในการแจ้งเตือนด้วยเสียงแบบไม่ต้องใช้มือควบคุม คำพูด หมายถึง "เปลี่ยนจากข้อความเป็นคำพูด" ระดับเสียงถูกควบคุมโดยแถบเลื่อน และในสภาวะปกติ การแจ้งเตือนด้วยเสียงจะทำงานเฉพาะในขณะที่หน้าจอเปิดอยู่เท่านั้น เพื่อแก้ไขปัญหานี้ คุณสามารถตั้งค่าให้หน้าจอให้เปิดอยู่เสมอโดยเลือกสวิตช์ "หน้าจอเปิดตลอดเวลา" หรือคุณสามารถเปิดใช้งานโหมด "TTS พร้อมปิดหน้าจอ" ก็ได้ ซึ่งการตั้งค่าแบบนี้จะเปิดใช้งานการทำงาน "พื้นหลัง" ในขณะที่หน้าจอของท่านปิดอยู่ และป้องกันไม่ให้อุปกรณ์เข้าสู่โหมดสลีป (พักเครื่อง) ท่านควรทดสอบโหมดพื้นหลังนี้สองถึงสามครั้งก่อนที่จะใช้งานจริง โทรศัพท์บางรุ่นอาจไม่รองรับเเอปนี้ ซึ่งเราจะไม่รับผิดชอบต่อกรณีใดๆ ทั้งสิ้น เมื่อท่านปิดแอปพลิเคชัน งานที่ทำอยู่เบื้องหลังจะหยุดทำงาน ท่านจะรู้ว่าแอปกำลังทำงานในเบื้องหลังโดยสังเกตจากไอคอนรูปดวงอาทิตย์ที่แสดงที่ด้านบนของพื้นที่แจ้งเตือนในโทรศัพท์ของท่าน (ซึ่งอยู่ใกล้กับเวลาและแถบสัญญาณ) หากแอป Buddhist Sun ไม่อยู่ใน "โหมดพื้นหลัง" ท่านจะไม่เห็นไอคอนรูปพระอาทิตย์ อย่างไรก็ตามฟีเจอร์นี้ไม่พร้อมใช้งานสำหรับผู้ใช้ iOS การประกาศคำพูดอยู่ในช่วงนาทีต่อไปนี้: 50,40,30,20,15,10,8,6,5,4,3,2,1,0 Privacy ความเป็นส่วนตัว: A full privacy statement is located at อ่านคำชี้แจงสิทธิส่วนบุคคลฉบับเต็มได้ที่: https://americanmonk.org/privacy-policy-for-buddhist-sun-app/ We do not collect information เราไม่เก็บข้อมูลส่วนตัวของผู้ใช้แอปนี้ในทุกกรณี
vi: Cách tính: Việc tính toán được dựa trên các phương trình từ các Thuật toán Thiên văn, bởi tác giả Jean Meeus. Kết quả mặt trời mọc và lặn chính xác theo lý thuyết trong phạm vi một phút cho những nơi nằm giữa +/-72° vĩ tuyến. Xin xem xét dừng trước thời gian được nêu. TRƯA: Màn hình buổi TRƯA hiển thị Mặt Trời Đứng Bóng cho ngày hiện tại như được chọn bởi GPS hoặc Thành Phố theo cách dễ nhìn. Tất cả thời gian theo mức an toàn từ phần cài đặt. (xem bên dưới) BÌNH MINH: Màn hình Bình Minh hiển thị công thức Bình minh đã được chọn từ phần cài đặt và cũng từ các tính toán mặt trời khác. Tất cả thời gian phản ánh theo mức an toàn từ phần cài đặt. Pa-Auk = (Mặt trời mọc - 40 phút). Na-uyana = ( Mặt trời mọc - 30 phút) (xem bên dưới) GPS: GPS sẽ tự động thiết lập thành phố nếu Internet được bật và hộp đánh dấu được bật. Xin khuyến cáo sử dụng cài đặt GPS để xác định vị trí của bạn vì Mặt Trời Đứng Bóng sẽ chính xác nhất theo cách này. Điều này chưa được kiểm tra theo vị trí "Tiết kiệm Ánh sáng Ban ngày". Cài đặt: Độ lệch: Được thiết lập tự động khi dùng GPS. Nếu bạn dùng Tìm kiếm Thành phố trong cài đặt, bạn phải chọn một độ lệch (GMT +- giờ địa phương của bạn). Mức an toàn: Điều này sẽ trừ số phút từ thời gian Giữa Trưa để cho sớm hơn và cộng số phút vào giờ Bình minh để làm cho trễ hơn. Vì công thức chính xác trong vòng một phút nên mặc định mức an toàn là một phút. Bình minh: Chọn bình minh ưa thích của bạn. Na-Uyana dùng Mặt trời mọc-30 minutes, và Pa-Auk dùng Mặt trời mọc - 40 phút. Mức an toàn sẽ cộng x-phút vào thời gian này. Bộ báo giờ: Màn hình báo giờ cho phép thông báo bằng âm thanh để rảnh tay. Lời nói có nghĩa là "Văn bản thành Lời nói". Âm lượng được kiểm soát bằng thanh trượt. Dưới điều kiện bình thường thông báo bằng lời nói chỉ hoạt động khi màn hình sáng. Để sửa đổi điều này, bạn có thể làm màn hình luôn sáng với nút chuyển "Màn hình luôn bật", hoặc bạn bật chức năng "TTS với màn hình tắt". Điều này sẽ bật hoạt động "nền" trong khi màn hình tắt và ngăn thiết bị đi vào chế độ ngủ. Bạn nên kiểm tra chức năng nền vài lần trước khi tín nhiệm nó. Một vài điện thoại có thể không cho phép điều này. Chúng tôi sẽ không chịu bất cứ trách nhiệm nào. Khi bạn đóng ứng dụng, có một lệnh được gọi để dừng các công việc dưới nền. Bạn sẽ biết ứng dụng đang chạy dưới nền bởi biểu tượng mặt trời được hiển thị trên đầu khu vực thông báo của điện thoại (chỗ thanh thời gian và tín hiệu). Nếu Buddhist Sun không ở trong "chế độ nền", bạn sẽ không thấy biểu tượng mặt trời. Chức năng này không có sẵn đối với người dùng iOS. Thông báo bằng lời nói thì ở trong các khoảng lặp theo số phút sau: 50,40,30,20,15,10,8,6,5,4,3,2,1,0 Riêng tư: Thông tin đầy đủ về sự riêng tư được đặt ở: https://americanmonk.org/privacy-policy-for-buddhist-sun-app/ Chúng tôi không thu thập thông tin.
zh: 算法: 计算依照让-米尔斯的天文算法公式进行。在南北纬72°间日出和日落的算值精度理论上偏差小于1分钟。请依预设时间恰当止息。 正午: 正午屏面以简便方式显示GPS地址或所在城市的当日太阳日中时间。所有时间值参考了设定的安全时差。（见下） 明相: 明相屏面显示根据设定和相关太阳算法而产生的明相时间。 所有时间值计入设定的安全时差。 帕奥 = (日出时间-40分钟)。 龙树林 = (日出时间-30分钟)。 (见下) GPS: 有网络且选择框打勾时，GPS会自动设定所在城市。 推荐使用GPS进行位置设定，这是计算正午时刻精度最佳的方式。此测试不包括 "夏令时" 区。 设定: 偏移: 此功能在 GPS状态下自动设置。 如果你选择在设定时使用城市搜索，你需要输入标准时差值 (GMT +- 本地时间). 安全时差: 正午时间减去此值令其略早，明相时间加上此值令其略晚。 本算法中精度差小于1分钟，所以缺省安全时差设定为1分钟。 明相: 可选择适合您的明相时间。 龙树林以日出前30分钟为明相时分，而帕奥则以日出前40分钟为明相。安全时差会加在您选择的明相设定时间。 计时器: 计时器屏面提供免操作语音提示。语音表示 "文本转语音"。 音量可以滑动调节。 通常情况下，屏面显示状态下语音提示可用。 若需, 您可以选择 "屏幕常亮" 以避免关屏或启动 "关屏时使用TTS" 功能。关屏时进入 "后台"运行，防止设备进入睡眠模式。 在确保其效果前，建议您多测试后台功能几次。有些手机可能不允许这类操作。我们不作任何保证。 关闭本应用，需要操作以停止后台运行任务。若你在手机顶部信息提示区（时间和信号等）看到本应用的太阳图标，则表示该应用正在后台运行中。否则，您将不会在此处见到该图标。该功能苹果系统用户尚未提供。 语音播报间隔为: 50,40,30,20,15,10,8,6,5,4,3,2,1,0 隐私: 详细的隐私声明请见: https://americanmonk.org/privacy-policy-for-buddhist-sun-app/ 我们不搜集任何信息，我们也不建立网络连接。在关闭状态下，本应用不在后台运行。GPS功能只有在您按下GPS按钮才因此而有唯一的一次启用。虽然本应用基于来自pub.dev网站的其它程序包，但我可以肯定，您在使用时是安全的。上述程序包在本应用“许可”页面，以及GitHub程序库中，有详细列明。
