Repository: bksubhuti/buddhist_sun
Catalog: lib/l10n/app_*.arb
Languages: hi, km, my, si, th, vi, zh

# about_content
source: Buddhist Sun is a small app for Buddhist monks and nuns to display the Solar Noon time specific to Buddhist monastic needs. Because I usually eat with my hands, I needed to have a "hands free" way to know when the Noon was approaching. The timer with voice notifications turned on helps me know the time left for eating. I enjoy using the app, and I hope that you do too. Why is this important? Those who follow Buddhist monastic rules are not allowed to eat after Noon. The rule is according to the sun at its zenith in the sky rather than a clock. They did not have clocks in the Buddha's time. Others who follow 8 or 10 precepts may find this app useful too. I recommend https://TimeandDate.com to verify this app's accuracy.This application is meant for "present moment/location" use. May this help you to reach Nibbāna quickly and safely!
hi: बौद्ध सूर्य एक छोटा ऐप है जो भिक्षु और भिक्षुणियों को सौर दोपहर का समय दिखाने में सहायता करता है। क्योंकि मैं हाथ से भोजन करता हूँ, मुझे दोपहर के निकट समय जानने का 'हैंड्स फ्री' तरीका चाहिए था। आवाज़ सूचना वाला टाइमर मुझे खाने का शेष समय जानने में मदद करता है। मुझे यह ऐप पसंद है, और आशा करता हूँ कि आपको भी यह सहायक लगेगा। यह क्यों महत्वपूर्ण है? जो लोग बौद्ध भिक्षु नियमों का पालन करते हैं, वे दोपहर के बाद नहीं खा सकते। यह नियम घड़ी पर नहीं बल्कि सूर्य की स्थिति पर आधारित है। बुद्ध के समय में घड़ियाँ नहीं थीं। जो लोग 8 या 10 उपोसथ शीलों का पालन करते हैं, उन्हें भी यह ऐप उपयोगी लग सकता है। मैं https://TimeandDate.com से इस ऐप की सटीकता की जाँच करने की अनुशंसा करता हूँ। यह ऐप वर्तमान स्थान और समय के उपयोग के लिए है। यह ऐप आपको शीघ्र और सुरक्षित रूप से निर्वाण प्राप्त करने में सहायक हो।
my: အကြောင်းအရာများ ဗုဒ္ဓနေဆော့ဝဲလ်(အက်ပလီကေးရှင်း)သည် ဗုဒ္ဓဘာသာ ဘုန်းတော်ကြီး၊ သီလရှင်များအတွက် ဝိနည်းဆိုင်ရာ နေမွန်းတည့်ချိန်ကို တိတိကျကျ ဖော်ပြသော အက်ပလီကေးရှင်းတစ်ခုဖြစ်သည်။ ယခုအပ်ပလီကေးရှင်း ရေးသားသူသည် ဆွမ်းကို လက်ဖြင့် အမြဲဘုဉ်းပေးလေ့ရှိသော ဘုန်းတော်ကြီးတပါးဖြစ်သည့် အားလျှော်စွာ မွန်းတည့်ချိန်ရောက်ဖို့ အချိန်မည်မျှ ကျန်သေးသည်ကို ဖုန်းကိုလက်ဖြင့် ထိစရာမလိုဘဲ သိဖို့ လိုအပ်ပါသည်။ အသံဖြင့် အချက်ပေးသော အချိန်မှတ်စက်သည် ဆွမ်းဘုဉ်းရန် အချိန်မည်မျှ ကျန်နေသေးသည်ကို သိရှိရန် အထောက်အကူ ပြုပါသည်။ ယခု အပ်ပလီကေးရှင်း မိမိအတွက် အသုံးပြုရတာ အဆင်ပြေသလို မိတ်ဆွေတို့အတွက်လည်း အသုံးတည့်လိမ့်မည်ဟု မျှော်လင့်ပါသည်။ မွန်းတည့်ချိန်အရေးကြီးခြင်းအကြောင်း ဗုဒ္ဓဘာသာရဟန်းတော်များအတွက် မွန်းတည့်နောက်ပိုင်း အစားမစားရန် တားမြစ်ထားသော ဝိနည်းစည်းကမ်းရှိပါသည်။ ထိုစည်းကမ်းလာ မွန်းတည့်ချိန်သည် နာရီအပေါ်တွင် အခြေမခံဘဲ နေပေါ်တွင် အခြေခံထားသည်။ ဘုရားရှင်ပွင့်ရာ အခါတုန်းက နာရီမရှိသေးပါ။ ၈-ပါးသီလ၊ ၁၀-ပါးသီလ စောင့်ထိန်းသူ လူပုဂ္ဂိုလ်မျးအတွက်လည်း ဤအက်ပလီကေးရှင်းသည် အသုံးဝင်ပါလိမ့်မည်ဟု မျှော်လင့်ပါသည်။ ဤအက်ပလီကေးရှင်းမှ တွက်ချက်ဖော်ပြချက်များ မှန်ကန်ကြောင်း စစ်ဆေးအတည်ပြုဖို့အတွက် https://TimeandDate.com ဟူသော ဝက်ဆိုဒ်၌ ကြည့်ရှုရန် အကြံပြုပါသည်။ ဤအက်ပလီကေးရှင်းသည် ရောက်ဆဲနေရာ၌ ရောက်ဆဲအချိန်ကို သိရှိနိုင်ရန်အတွက် ရည်ရွယ်ပါသည်။ ယခုအပ်ပလီကေးရှင်းသည် သင့်အတွက် နိဗ္ဗာန်သို့ မပင်မပန်း လျှင်စွာရောက်စေကြောင်း အထောက်အပံ့ ဖြစ်ပါစေသော်။
vi: Buddhist Sun là một ứng dụng nhỏ chuyên hiển thị giờ mặt trời đứng bóng dành cho các vị sư và tu nữ Phật giáo theo các nhu cầu Giới Luật Phật giáo. Bởi vì tôi thường ăn bốc bằng tay, tôi cần có một cách "rảnh tay" để biết khi nào sắp tới giờ mặt trời đứng bóng. Bộ báo giờ với thông báo bằng lời nói được bật sẽ giúp tôi biết thời gian còn lại để ăn. Tôi ưa thích sử dụng ứng dụng này và tôi hy vọng các bạn cũng thế. Tại sao điều này lại quan trọng? Những ai tuân thủ Giới Luật thì không được phép ăn sau giữa trưa. Quy tắc này dựa vào mặt trời lúc đứng bóng hơn là đồng hồ. Họ không có đồng hồ vào thời đức Phật. Những ai tuân theo 8 hay 10 giới cũng có thể thấy sự hữu dụng của ứng dụng này. Tôi xin giới thiệu trang https://TimeandDate.com để kiểm tra sự chính xác của ứng dụng này. Ứng dụng này có ý nghĩa dùng cho "khoảnh khắc/vị trí hiện tại". Cầu mong điều này trợ giúp các bạn chứng ngộ Nibbāna một cách nhanh chóng và an toàn!
zh: BuddhistSun（佛日）是一款面向佛教比丘、比丘尼的小应用，显示日中、明相等，满足日常修行生活需要。因为我本人常以手进食，我需要一种"免于动手"的方式知道何时日中临近。开通语音提醒功能的计时器可以方便地让我了解还剩下多少用斋的时间。我很开心手头有这款小应用，希望您也会喜欢上它。 有那么重要吗？你也许会问。 是的，确实重要。遵从佛制僧规的人都知道过午不可再食。中午时刻是根据太阳在天空中的最高点而不是闹钟来确定的，再说，佛世时也没有闹钟。其他持守八戒或者十戒的修行人也将会发现这款小应用的价值。 我推荐使用 https://TimeandDate.com 来验证本应用的精确度。本应用致力于满足您"此时/处" 的实际需求。 谨愿此应用助您早日安稳无差达至涅槃！

# gps_permission_content
source: Permission will be requested for GPS use. This allows for Buddhist Sun to know the GPS Location Data to calculate the sun's position. GPS is only collected once for each time the GPS button is pressed. Data is not sent outside this app.
hi: जीपीएस उपयोग के लिए अनुमति मांगी जाएगी। यह बौद्ध सूर्य को सूर्य की स्थिति गणना के लिए स्थान डेटा जानने की अनुमति देता है। प्रत्येक बार जीपीएस बटन दबाने पर डेटा केवल एक बार प्राप्त किया जाता है। यह डेटा ऐप के बाहर नहीं भेजा जाता।
my: ဂျီပီအက်စ် အသုံးပြုရန်အတွက် ခွင့်ပြုချက် တောင်းလိမ့်မည်။ ဂျီပီအက်တည်နေရာပေါ် မူတည်ပြီး နေမွန်းတည့် အနေအထား တွက်ချက်ရန်အတွက် အထက်ပါ ခွင့်ပြုချက် လိုအပ်ပါသည်။ ဂျီပီအက်စ် ခလုပ်ကို နှိပ်သည့်အခါခဏ၌သာ ဂျီပီအက်အချက်အလက်ကို တကြိမ်မျှ ရယူပါသည်။ အချက်အလက်များကို ဤအက်ပလီကေးရှင်းမှလွဲ၍ တခြားနေရာများသို့ မပို့ပါ။
th: จะมีการขออนุญาตสำหรับการใช้ GPS ซึ่งช่วยให้ Buddhist Sun ทราบข้อมูลตำแหน่ง GPS เพื่อคำนวณตำแหน่งของดวงอาทิตย์ ซึ่ง GPS จะถูกรวบรวมเพียงครั้งเดียวในแต่ละครั้งที่มีการกดปุ่ม GPS Data is not sent outside this app ข้อมูลจะไม่ถูกส่งออกไปนอกแอปนี้
vi: GPS yêu cầu được dùng quyền này. Quyền này giúp Buddhist Sun biết dữ liệu vị trí GPS để tính vị trí mặt trời. GPS chỉ thu thập 1 lần mỗi khi nút GPS được bấm. Dữ liệu không được gởi ra ngoài app.
zh: 请允准使用GPS，以便本应用获得GPS地址数据来计算太阳位置。按下GPS钮，仅执行一次数据采集。所采集数据仅在本APP范围内使用。

# background_permission_content
source: Permission will be requested for background use. This permission is needed to enable speech notifications to run properly the screen on. Buddhist Sun will turn off this Background process when the switch is turned off or the app is closed. Permission will be requested only one time if accepted.
hi: पृष्ठभूमि उपयोग के लिए अनुमति मांगी जाएगी। यह अनुमति वाणी सूचनाओं को सही ढंग से चलाने के लिए आवश्यक है। जब स्विच बंद किया जाता है या ऐप बंद होता है, तो यह प्रक्रिया रुक जाती है। अनुमति केवल एक बार मांगी जाएगी।
my: နောက်ကွယ်မှနေ၍ ⁠လုပ်ဆောင်မှုများ အတွက် ခွင့်ပြုချက် တောင်းပါလိမ့်မည်။ အသံဖြင့် အသိပေးချက် အလုပ်လုပ်နိုင်ဘို့အတွက် အထက်ပါ ခွင့်ပြုချက် လိုအပ်ပါသည်။ ခွင့်ပြုချက်ခလုပ်ကို ပိတ်သောအခါ (သို့မဟုတ်) အပ်ပလီကေးရှင်းကို ပိတ်သောအခါ၌ နောက်ကွယ်⁠လုပ်ဆောင်နိုင်စွမ်းခွင့်ပြုချက် ပိတ်ပါလိမ့်မည်။ အထက်ပါ ခွင့်ပြုချက်ကို တကြိမ်သာ တောင်းပါလိမ့်မည်။
th: จะมีการขออนุญาตเพื่อใช้ในพื้นหลัง การอนุญาตนี้จำเป็นต่อการเปิดใช้งานการแจ้งเตือนด้วยเสียงเพื่อให้แอปทำงานบนหน้าจอได้อย่างถูกต้อง Buddhist Sun จะปิดโหมดพื้นหลังนี้เมื่อปิดสวิตช์หรือปิดแอป Permission will be requested only one time if accepted แอปจะขออนุญาตเพียงครั้งเดียวหากได้รับการยอมรับ
vi: Việc chạy nền yêu cầu được dùng quyền này. Thông báo bằng lời cần quyền này để chạy mở màn hình. Buddhist Sun sẽ tắt tiến trình nền này khi tắt nút chuyển này hoặc khi đóng app này. Nếu được chấp nhận, quyền này chỉ yêu cầu 1 lần.
zh: 请允准后台启用，以确保屏面显示期间语音提示功能可以正常使用。当您关闭启用或关闭本APP时，后台运程将随之终止。同意启用后，则本请求不再发出。
